Revit 2024 API
BuiltInFailures.CutFailures.CantCutHostWithInstance Property
 Can't cut host with instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CantCutHostWithInstance { get; }
Visual Basic
Public Shared ReadOnly Property CantCutHostWithInstance As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CantCutHostWithInstance {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CutFailures Class
Autodesk.Revit.DB Namespace